import re
from os import path
from pymongo import UpdateOne

import sys
sys.path.insert(0, path.dirname(path.dirname(path.abspath(__file__))))

from base.base_func import with_db, get_name_img, make_page_no
from extract_pdf_fold import call_ocr
from base.parse_text import parse_name, clean_text, re_digit

_cache = {}
deleted = 'deleted'


def ocr_unknown_name(db):
    """对待定扣名单独调用OCR"""
    names = set()
    for r in db.sx_fold.find({'text': '?', deleted: None}, sort=[('bid', 1)]):
        han, vol_pdf, pi, idx, bid, end = [r[f] for f in [
            'han', 'vol_pdf', 'pi', 'idx', 'bid', 'end']]
        img_file = get_name_img(han, vol_pdf, pi, idx)
        n = call_ocr(db, img_file, han, vol_pdf, f'{bid}_{int(end)}')
        if n:
            names.add(r['pdf_name'])
    print(','.join(sorted(list(names))))


def fix_fold_no_name(db):
    """113条有扣图、没有扣名，补充扣名"""
    changed, warns = 0, []
    for r in db.sx_fold.find(dict(text=None, fold_mean={'$ne': None}), sort=[('bid', 1)]):
        _fill_one_fold_no(db, r, warns)
    print('\n'.join(warns))


def fill_folds_no_1(db):
    """对没有扣号的扣名补全"""
    ids = ['400_3_7_1', '464_5_5_1', '313_2_8_1', '386_9_4_1', '459_1_5_1', '497_5_5_1',
           '362_9_3_1', '465_3_9_1', '384_6_6_1', '497_4_2_1']
    _fill_many_fold_no(db, ids)


def fill_folds_abc(db, only_han=0):
    """对半页内没有扣号的补全扣名"""
    ids = '104_10_2,108_1_0,112_10_0,112_10_8,114_1_7,114_5_8,118_1_0,118_7_0,120_1_0,121_1_0,139_10_0,141_10_0,141_1_0,141_7_0,141_8_0,142_10_0,142_1_0,142_6_0,142_7_0,142_8_0,142_9_0,143_10_0,143_1_0,143_4_6,143_6_0,143_7_0,143_8_0,143_9_0,144_10_0,144_1_0,144_3_8,144_6_0,144_7_0,144_8_0,144_9_0,147_1_0,147_6_0,165_3_7,167_6_9,171_10_0,171_11_0,171_1_0,171_6_0,171_7_0,172_10_0,172_6_0,172_7_0,172_9_0,175_1_0,177_1_0,177_6_0,177_7_0,177_8_0,178_10_0,178_1_0,178_6_0,178_7_0,178_8_0,178_9_0,181_10_0,181_1_0,181_6_0,181_7_0,181_8_0,181_9_0,182_1_0,182_6_0,187_10_0,187_11_0,187_1_0,187_1_6,187_6_0,187_7_0,187_8_0,187_9_0,188_1_0,188_6_0,188_9_0,189_10_0,189_1_0,189_7_0,189_9_0,190_10_0,190_1_0,190_6_0,190_7_0,190_8_0,190_9_0,191_10_0,191_2_6,191_6_0,191_7_0,191_8_0,191_9_0,194_10_0,194_1_0,194_6_0,194_7_0,194_8_0,194_9_0,195_1_0,195_7_0,195_9_0,196_1_8,198_1_0,199_9_0,200_1_0,200_7_0,200_8_0,200_9_0,258_4_6,258_4_8,258_7_0,258_8_4,288_1_0,288_1_8,290_1_0,290_1_8,290_2_0,290_9_5,292_5_4,293_6_0,294_3_6,294_6_5,299_4_6,299_8_4,299_8_5,299_9_4,300_1_0,300_8_0,301_8_0,302_8_0,306_10_10,306_3_6,306_3_8,306_8_0,306_8_10,309_3_7,309_9_0,310_5_8,310_6_4,310_9_0,311_1_7,311_1_8,311_2_6,311_2_8,311_3_6,311_3_7,311_3_8,311_4_4,311_4_6,311_4_7,311_4_8,311_5_4,311_6_10,311_6_4,311_6_9,311_7_4,311_8_5,312_1_6,312_1_7,312_1_9,312_4_6,312_4_7,313_1_7,313_2_6,313_2_7,313_4_4,313_6_9,313_9_5,328_7_0,328_9_0,329_5_4,329_7_10,329_7_5,331_1_8,331_5_5,331_7_0,332_5_8,332_6_4,334_10_8,334_10_9,335_10_8,335_1_7,335_1_9,335_2_6,335_4_4,335_4_7,335_5_8,335_6_4,335_7_0,335_7_5,337_3_7,337_6_0,337_6_10,337_6_9,337_7_0,338_2_7,338_3_8,338_5_4,338_5_7,339_2_6,339_9_0,340_1_0,340_1_9,340_2_6,340_4_6,340_4_8,340_5_7,340_7_5,342_6_9,342_7_9,342_9_0,344_4_4,344_7_0,345_1_0,345_2_6,345_2_7,346_7_8,347_4_6,347_4_7,347_6_0,349_8_0,349_9_0,349_9_5,350_10_8,350_8_0,351_4_6,353_1_7,359_5_4,361_7_4,362_10_0,362_3_4,362_3_5,362_5_5,362_6_0,362_7_0,362_8_0,362_9_1,363_8_0,365_4_6,365_5_5,365_5_7,365_6_4,366_1_0,366_7_0,366_7_3,366_7_4,366_8_0,367_5_4,367_6_4,367_8_1,367_8_4,367_9_4,368_4_4,371_10_0,371_11_0,371_4_6,371_9_0,372_1_0,372_6_0,372_7_0,372_8_0,372_9_0,373_10_0,373_6_0,373_7_0,373_8_0,373_9_0,374_10_0,374_6_0,374_7_0,374_8_0,374_9_0,375_10_0,375_1_0,375_6_0,375_7_0,375_7_4,375_8_0,375_9_0,377_10_0,377_1_0,377_6_0,377_7_0,377_8_0,377_9_0,378_10_0,378_1_0,378_1_7,378_2_5,378_6_0,378_7_0,378_8_0,378_8_5,378_9_0,378_9_5,379_10_0,379_1_0,379_6_0,379_7_0,379_7_5,379_8_0,379_8_5,379_9_0,379_9_4,380_10_0,380_1_0,380_4_4,380_5_5,380_6_0,380_7_0,380_8_0,380_9_0,381_10_0,381_1_0,381_2_6,381_3_6,381_4_6,381_5_5,381_6_0,381_7_0,381_8_0,381_9_0,381_9_4,382_10_0,382_1_0,382_1_5,382_2_1,382_2_5,382_2_6,382_6_0,382_7_0,382_8_0,382_9_0,382_9_3,383_10_0,383_1_0,383_5_7,383_6_0,383_6_5,383_7_0,383_7_5,383_8_0,383_9_0,383_9_4,384_10_0,384_1_0,384_2_1,384_2_5,384_2_6,384_2_7,384_4_4,384_5_5,384_6_0,384_7_0,384_8_0,384_8_2,384_9_0,384_9_1,384_9_3,384_9_4,385_10_0,385_1_0,385_3_5,385_5_5,385_6_0,385_6_2,385_6_3,385_6_4,385_7_0,385_9_0,386_10_0,386_1_0,386_6_0,386_7_0,386_8_0,386_9_0,387_1_0,387_5_5,387_6_0,387_6_4,387_7_0,387_7_4,387_8_0,387_8_1,387_8_4,387_9_0,387_9_1,388_10_0,388_10_5,388_7_0,388_8_0,388_9_0,389_10_0,389_6_0,389_9_0,390_10_0,390_1_0,390_6_0,390_7_0,394_1_0,394_6_0,395_10_0,395_1_0,395_7_0,395_8_0,395_9_0,396_10_0,396_1_0,396_6_0,396_7_0,396_8_0,396_9_0,397_10_0,397_10_7,397_7_0,397_8_0,397_9_0,398_10_0,398_1_0,398_7_0,398_8_0,398_9_0,399_1_0,399_6_0,405_10_0,405_6_0,405_8_0,406_10_0,406_9_0,409_10_0,409_10_7,409_1_0,409_6_0,409_8_0,409_9_0,409_9_4,410_7_0,412_1_0,412_6_0,412_7_0,413_1_0,413_6_0,413_6_4,413_7_5,413_8_0,414_10_0,414_6_0,414_6_4,414_7_0,414_8_0,414_8_9,414_9_0,415_1_0,415_2_8,415_6_0,415_7_0,415_8_0,415_9_0,416_1_0,416_6_0,416_9_0,417_7_0,417_8_0,417_8_4,417_9_0,418_10_0,418_1_0,418_1_10,418_2_7,418_3_10,418_3_3,418_3_4,418_6_0,418_8_0,419_11_0,419_2_7,419_3_8,419_5_7,419_6_0,419_6_3,419_6_4,419_6_9,419_7_0,419_8_0,419_9_0,420_1_5,420_2_6,420_4_7,420_4_8,420_4_9,420_6_0,420_6_4,420_6_9,420_7_0,420_8_0,420_9_0,421_2_6,421_7_0,422_4_4,422_6_0,422_7_0,422_8_0,422_9_0,424_5_5,424_7_0,424_8_0,425_1_0,425_6_0,425_6_4,425_8_0,425_9_0,426_1_0,426_1_10,426_1_9,426_2_6,426_4_6,426_4_8,426_4_9,426_6_0,426_9_3,426_9_4,426_9_9,428_1_0,428_3_8,428_6_0,429_10_0,429_11_0,429_1_0,429_2_6,429_5_8,429_6_0,429_6_4,429_7_0,429_8_0,429_9_0,430_1_0,430_4_4,430_5_7,430_6_0,430_6_9,430_7_0,430_8_0,430_9_0,430_9_9,431_5_5,431_7_3,431_7_4,432_3_9,432_5_5,433_3_6,433_4_4,433_6_4,435_2_10,435_2_4,435_5_8,435_8_5,438_1_10,440_1_7,440_8_4,440_8_9,445_10_0,445_1_0,445_6_0,445_7_0,445_8_0,445_9_0,446_4_6,446_5_7,446_5_8,446_7_4,447_2_8,447_4_4,447_4_6,447_4_7,447_5_5,447_6_4,448_3_7,448_6_10,449_2_3,449_2_4,449_2_7,449_4_8,449_5_4,449_5_5,449_9_4,450_2_8,450_3_6,451_10_7,451_9_0,452_6_4,455_5_5,459_1_8,459_2_8,460_1_8,464_6_5,464_7_11,464_7_4,464_8_14,464_8_4,464_9_10,464_9_17,464_9_4,464_9_9,465_2_6,465_2_7,465_3_8,465_9_10,465_9_4,466_1_7,466_9_9,467_5_7,468_3_7,469_6_9,471_1_8,471_6_10,471_7_10,471_7_4,471_8_3,472_6_10,472_6_4,472_6_9,472_7_5,472_7_9,474_1_7,474_4_7,474_6_10,474_7_4,476_10_8,476_2_8,476_9_10,477_10_8,477_8_9,478_4_8,479_3_7,482_10_9,482_3_6,482_3_7,482_4_6,482_4_7,482_6_4,482_6_5,482_7_4,482_7_5,482_8_5,482_9_4,484_1_16,484_4_7,484_6_5,484_6_9,486_10_9,487_10_4,487_10_5,487_10_7,487_2_7,487_3_10,487_3_11,487_4_7,487_6_5,487_7_5,487_9_5,488_8_4,489_8_4,490_10_0,490_10_7,490_6_0,490_6_3,490_6_4,490_7_0,490_7_1,490_7_4,490_8_0,490_9_0,490_9_4,491_2_6,492_3_5,492_4_4,493_7_4,496_7_4,497_4_3,497_6_3,497_6_4,497_7_4,500_7_5,501_6_0,502_5_4,504_1_0,507_1_0,513_10_0,513_6_4,513_7_0,515_7_0,516_7_0,517_7_0,518_1_0,533_1_5,533_7_5,534_1_0,534_1_5,534_2_0,534_2_1,534_2_10,534_2_4,534_7_4,535_6_4,535_8_0,535_8_4,535_8_5,536_9_10,537_6_4,538_4_6,539_10_0,539_10_3,539_1_0,540_1_0,540_8_5,541_8_4,545_8_6,546_5_7,546_5_8,108_2_0,114_1_5,115_2_0,115_5_0,118_2_0,118_3_0,118_4_0,120_3_0,141_2_0,141_5_0,142_2_0,142_3_0,142_4_0,142_5_0,143_2_0,143_3_0,143_4_0,143_5_0,144_2_0,144_2_1,144_3_0,144_4_0,144_5_0,147_4_0,167_3_5,171_2_0,171_3_0,171_4_0,172_2_0,172_3_0,172_4_0,172_5_0,173_3_0,176_5_0,177_2_0,177_3_0,177_4_0,177_5_0,178_1_6,178_2_0,178_3_0,178_4_0,178_5_0,181_2_0,181_4_0,181_5_0,182_2_0,182_3_0,182_4_0,183_2_0,183_3_0,183_4_0,187_12_0,187_1_7,187_2_0,187_3_0,187_4_0,187_5_0,188_2_0,188_3_0,188_4_0,188_5_0,189_2_0,189_3_0,189_4_0,189_5_0,190_2_0,190_3_0,190_4_0,190_5_0,191_2_0,191_3_0,191_4_3,191_4_8,191_5_0,194_2_0,194_3_0,195_2_0,195_3_0,195_4_0,195_5_0,196_10_5,196_2_0,196_3_0,196_4_0,196_5_0,197_1_5,197_1_6,198_2_0,200_2_0,200_3_0,200_4_0,200_5_0,256_1_5,258_4_0,258_4_3,258_4_5,258_7_3,290_1_1,290_1_4,293_3_2,293_7_1,294_2_1,294_3_4,294_6_2,299_7_2,299_9_1,300_2_0,300_5_0,306_2_1,306_8_2,306_9_3,307_3_0,310_9_2,311_1_1,311_1_4,311_1_5,311_2_1,311_2_2,311_2_4,311_2_5,311_2_9,311_3_2,311_3_3,311_3_4,311_3_5,311_3_9,311_4_3,311_4_5,311_6_1,311_6_11,311_6_3,311_7_1,311_8_1,311_8_2,312_1_5,313_1_1,313_2_1,313_2_10,313_2_11,313_2_2,313_2_4,313_2_5,313_2_9,328_2_0,329_7_1,329_8_3,330_2_1,330_4_0,332_6_3,332_7_2,332_8_1,333_4_0,333_4_3,335_10_1,335_1_5,335_2_1,335_2_10,335_2_9,335_3_3,335_3_4,335_6_1,335_6_11,335_7_2,335_9_1,335_9_3,337_2_5,337_3_0,337_3_2,337_3_3,337_4_0,337_4_3,337_4_5,337_4_9,337_7_1,337_7_2,338_1_5,338_2_0,338_2_2,338_3_0,338_3_9,338_5_0,338_5_9,338_7_3,338_8_2,340_2_0,340_4_0,340_4_3,340_5_0,340_5_10,341_5_10,342_3_2,342_9_1,342_9_3,343_1_5,344_3_2,344_7_3,345_1_1,345_3_5,346_6_1,347_3_5,347_4_9,347_5_0,347_8_1,347_9_1,347_9_3,348_3_9,348_5_0,349_3_3,349_5_0,351_7_1,353_2_4,358_2_4,359_1_5,360_5_0,362_2_0,362_3_0,362_3_1,362_3_2,362_4_0,362_4_5,362_5_0,362_9_2,363_1_4,363_4_3,363_8_1,364_10_4,364_4_3,364_4_5,365_5_3,366_10_4,366_7_1,366_7_2,366_8_1,366_8_2,366_8_5,367_2_4,367_8_2,367_8_5,369_2_0,370_3_3,371_12_0,371_1_4,372_2_0,372_3_0,372_4_0,372_5_0,372_8_1,373_2_0,373_3_0,373_4_0,373_5_0,373_8_1,374_3_0,374_4_0,374_5_0,375_2_0,375_3_0,375_4_0,375_7_1,375_7_2,375_7_5,377_2_0,377_3_0,377_4_0,378_10_1,378_1_4,378_2_0,378_2_1,378_2_2,378_3_0,378_4_0,378_5_0,378_6_1,379_2_0,379_3_0,379_4_0,379_4_3,379_5_0,379_9_1,380_1_4,380_2_0,380_3_0,380_3_4,380_4_0,380_5_0,381_1_4,381_2_0,381_3_0,381_3_3,381_4_0,381_5_0,381_9_1,381_9_2,381_9_5,382_10_4,382_1_1,382_1_3,382_2_0,382_2_2,382_2_3,382_3_0,382_4_0,382_9_1,382_9_2,382_9_5,383_10_3,383_1_4,383_2_0,383_3_0,383_5_0,383_5_3,383_6_1,383_6_3,383_8_1,383_9_3,384_2_0,384_2_2,384_2_3,384_3_0,384_3_5,384_4_0,384_4_5,384_5_0,384_8_1,384_9_2,385_3_0,385_4_0,385_5_0,385_6_1,385_6_5,386_2_0,386_3_0,386_5_0,387_1_4,387_2_5,387_3_0,387_3_5,387_4_0,387_4_1,387_5_0,387_6_1,387_6_2,387_6_5,387_7_2,387_7_3,387_8_2,387_8_5,387_9_2,387_9_5,388_10_1,388_10_3,388_2_0,388_2_5,388_3_4,389_2_0,389_4_0,390_2_0,390_3_0,390_4_0,390_5_0,394_2_0,394_3_0,394_4_0,394_4_3,394_5_0,395_2_0,395_3_0,395_4_0,395_5_0,396_2_0,396_3_0,396_4_0,396_5_0,397_2_0,397_3_0,397_4_0,397_5_0,398_2_0,398_3_0,399_2_0,399_3_0,399_5_0,400_2_5,406_2_0,406_4_0,407_3_0,407_4_0,409_4_0,409_9_1,409_9_2,409_9_5,412_2_0,412_3_0,413_2_0,413_5_0,413_8_3,414_2_0,414_4_0,414_5_0,414_6_1,414_6_2,414_6_5,415_1_1,415_3_0,415_4_0,415_5_0,416_2_0,416_3_0,416_5_0,417_3_0,417_4_0,417_5_0,417_8_3,418_12_0,418_2_0,418_2_4,418_3_0,418_3_1,418_3_11,418_3_2,418_3_5,418_4_0,418_5_0,419_1_11,419_2_0,419_2_5,419_3_5,419_6_1,420_2_0,420_3_0,420_3_10,420_5_0,420_9_1,421_2_0,421_3_0,421_3_9,421_5_0,421_7_1,421_7_3,422_2_0,422_4_0,422_5_0,422_6_1,425_4_0,425_5_0,425_5_9,425_6_11,425_6_2,425_6_5,425_8_11,426_1_11,426_3_0,426_3_5,426_4_0,426_4_10,426_4_3,426_9_1,426_9_11,428_1_3,428_3_0,428_4_0,428_5_0,428_5_9,429_11_5,429_12_0,429_13_0,429_2_0,429_3_0,429_4_0,429_5_0,429_6_1,429_6_2,429_9_1,430_2_0,430_2_4,430_3_0,430_3_4,430_4_0,430_5_0,430_5_10,430_7_11,431_7_1,431_7_5,432_10_1,432_11_5,435_2_1,435_2_11,435_2_2,435_2_5,438_1_11,440_1_1,440_1_3,440_1_4,442_2_0,442_2_2,445_10_1,445_10_2,445_10_3,445_2_0,445_3_0,445_4_0,445_5_0,446_1_3,446_7_1,446_7_11,446_7_2,446_7_5,447_1_10,447_2_0,447_6_2,448_3_10,448_3_5,449_10_1,449_10_4,449_2_1,449_2_11,449_2_5,449_3_5,449_4_10,449_6_1,449_7_1,449_7_3,449_9_1,449_9_11,449_9_2,449_9_5,450_3_3,454_7_1,457_5_15,464_5_5,464_6_2,464_7_1,464_7_13,464_7_2,464_7_5,464_8_1,464_8_11,464_8_2,464_9_11,464_9_15,464_9_2,465_2_10,465_2_9,465_3_3,465_3_4,465_3_5,465_6_1,465_8_2,465_9_1,465_9_2,465_9_5,466_2_4,466_4_5,466_9_11,468_4_3,469_8_15,471_1_1,471_3_4,471_7_1,471_7_11,471_7_13,471_7_2,471_7_5,471_8_1,471_8_2,471_8_5,472_3_3,472_3_5,472_7_1,472_8_11,473_4_3,474_6_11,475_4_3,475_4_5,475_4_9,476_1_4,476_6_1,476_6_2,477_10_4,477_3_18,477_5_16,477_8_15,477_8_2,480_7_2,481_1_1,481_2_2,482_10_4,482_10_5,482_1_5,482_3_5,482_3_9,482_4_3,482_4_9,482_9_2,482_9_3,484_3_9,485_6_10,485_6_2,486_4_1,487_10_1,487_2_5,487_2_9,487_3_12,487_3_3,487_9_1,487_9_3,488_2_11,489_8_2,490_4_5,490_6_1,490_6_2,490_6_5,490_7_2,490_7_5,491_2_5,491_8_3,492_2_5,493_10_1,493_10_2,494_3_0,494_6_3,494_7_1,494_7_2,496_2_4,497_5_5,497_6_1,497_7_1,497_7_2,498_6_3,499_2_4,504_1_1,507_2_0,507_4_0,507_7_2,508_1_4,508_2_2,508_7_3,509_10_1,509_2_1,509_6_3,509_7_3,511_10_4,511_1_4,511_6_2,511_7_2,513_1_1,513_2_2,515_3_0,516_1_1,517_1_4,518_1_4,518_2_0,521_7_1,522_7_3,523_6_1,523_7_1,526_2_1,526_7_3,533_1_1,533_2_0,533_3_5,533_7_3,533_8_1,533_8_2,534_1_1,534_1_3,534_1_4,534_2_2,534_2_5,534_7_1,534_7_2,534_8_1,537_6_1,537_6_2,537_6_5,539_10_1,539_10_2,539_2_0,539_4_0,540_3_0,541_8_1,541_8_2,541_8_5,544_4_0,545_3_0,545_3_6,545_8_0,545_8_7,545_8_9,546_5_0,546_5_9,547_9_6,114_1_3,160_1_2,167_2_12,190_5_7,190_5_9,191_4_9,197_1_7,289_3_1,290_1_2,301_1_3,306_9_12,311_1_2,311_2_3,311_3_1,311_4_2,311_5_1,311_5_2,312_1_13,312_4_1,313_2_3,313_2_8,313_4_1,327_4_1,330_2_3,330_5_1,330_5_3,332_10_2,333_4_1,333_5_1,333_5_3,335_10_2,335_3_1,335_4_2,335_6_12,337_1_3,337_4_11,337_6_12,337_6_13,338_1_12,338_3_1,338_5_3,339_5_1,340_2_3,340_5_11,340_5_2,342_1_2,342_1_3,342_6_14,344_4_1,347_5_1,349_1_2,349_3_1,355_10_2,360_5_1,360_5_2,362_5_1,362_5_2,363_1_0,363_1_2,363_1_5,365_5_1,365_5_2,367_2_3,374_3_1,378_1_2,378_1_5,378_3_1,378_5_1,380_1_2,380_1_5,380_4_1,380_5_1,380_5_3,381_1_2,381_1_5,381_5_1,382_1_2,383_4_1,383_5_1,383_5_2,383_5_4,385_3_1,385_5_1,385_5_2,386_5_1,386_5_2,387_1_2,387_1_5,387_3_1,387_4_2,387_4_5,387_5_1,387_5_3,388_10_2,398_2_3,398_5_1,398_5_2,399_4_1,400_3_7,412_2_3,413_4_1,413_5_3,415_3_1,417_12_4,419_2_12,420_1_2,420_4_1,420_4_2,420_5_3,422_10_2,425_10_3,426_4_1,426_4_11,426_4_2,426_4_5,426_5_2,426_5_4,429_13_5,430_5_1,430_5_11,430_5_2,430_5_4,431_4_2,431_4_5,435_5_3,440_1_2,440_1_5,440_3_1,446_1_2,446_1_5,446_4_14,447_2_12,447_5_2,447_5_3,447_6_12,449_5_1,449_8_12,449_9_12,450_1_2,453_2_3,457_10_12,459_1_5,464_7_12,464_9_13,464_9_14,465_4_1,466_3_13,472_4_15,474_1_12,476_10_2,477_10_2,477_3_12,477_3_19,477_5_19,481_1_3,481_5_1,482_4_11,482_4_2,484_1_13,485_5_1,487_4_11,487_4_13,487_5_2,488_2_12,490_10_2,490_10_5,491_2_3,491_3_1,492_1_3,492_3_1,493_2_1,493_2_2,497_4_1,508_1_3,509_1_2,509_1_3,509_3_1,509_5_1,511_1_2,513_10_2,513_4_1,521_5_1,523_4_2,525_8_0,533_1_0,533_1_2,534_1_2,547_9_0,547_9_7,167_2_13,178_1_5,178_1_7,187_1_5,190_5_6,190_5_8,191_4_7,231_1_7,231_2_7,288_2_10,290_8_8,307_6_11,313_4_2,331_2_10,335_5_13,362_3_3,362_5_3,363_1_3,366_8_3,367_8_3,375_7_3,378_1_3,378_2_3,380_1_3,381_1_3,381_9_3,383_10_1,384_6_3,385_3_3,385_5_3,386_5_3,386_9_3,387_1_3,387_4_4,387_6_3,387_8_3,387_9_3,407_10_4,409_9_3,414_6_3,418_12_2,418_12_4,418_12_5,418_3_13,418_3_9,419_6_2,420_1_3,420_4_4,425_6_3,425_6_9,426_4_4,426_5_3,426_9_2,428_1_1,429_6_3,429_6_9,430_5_13,430_5_3,430_5_9,431_7_2,435_2_3,435_2_9,446_7_13,446_7_3,446_7_9,449_2_2,449_9_3,449_9_9,464_7_3,464_7_9,464_8_13,464_8_3,464_8_9,465_9_3,470_2_14,471_7_3,471_7_9,471_8_9,477_5_13,482_4_12,484_5_13,485_6_3,485_6_9,487_2_13,487_3_4,487_3_9,490_10_3,490_6_9,490_7_3,492_3_3,494_7_3,497_6_2,497_7_3,533_1_3,533_8_3,534_2_3,534_2_9,534_7_3,537_6_3,541_8_3,545_3_5,545_3_7,545_8_5,545_8_8,546_5_6,547_9_5,84_2_0,112_8_7,142_8_8,167_3_4,183_5_6,187_4_2,191_4_0,231_8_7,238_5_6,258_5_6,258_6_6,284_9_5,290_7_6,306_7_8,311_1_6,311_6_6,311_6_8,312_7_6,313_1_6,332_6_7,332_7_8,333_6_8,335_1_6,335_6_6,335_6_7,335_7_7,335_8_8,335_9_6,335_9_7,337_1_6,337_7_7,338_1_6,340_1_6,340_7_6,348_5_6,362_5_4,362_9_5,364_9_6,365_5_4,365_5_6,378_2_4,382_10_6,382_1_4,382_1_6,382_2_4,383_1_6,383_5_6,383_9_6,384_2_4,384_5_6,384_8_5,385_3_4,385_5_4,386_5_4,388_10_4,392_5_6,398_7_6,417_8_6,417_8_7,419_6_5,419_6_6,419_6_7,419_6_8,420_1_4,420_6_7,420_7_6,426_1_6,426_6_7,426_7_7,426_9_5,426_9_7,428_5_6,429_6_5,430_1_6,430_6_6,432_1_6,432_6_6,432_7_6,435_8_6,445_10_4,445_10_5,446_1_4,446_7_8,452_8_8,455_8_7,464_5_6,464_7_6,464_7_7,464_8_5,464_9_7,465_9_8,465_9_9,466_9_6,468_5_6,470_1_6,471_8_8,474_6_7,476_5_6,476_8_6,477_9_8,480_6_7,482_6_6,482_7_7,482_7_8,483_6_6,484_6_8,485_6_5,485_7_6,487_9_6,487_9_7,490_10_4,490_8_7,492_3_4,533_1_4,533_7_6,539_10_5'
    ids = [r['bid'] for r in db.sx_fold_check.find(dict(
        pid={'$in': ids.split(',')}, err_fold_no='no'), {'bid': 1})]
    warns, changed = [], 0
    for r in db.sx_fold.find(dict(bid={'$in': ids}, text_status=0,
                                  deleted=None), sort=[('bid', 1)]):
        if not only_han or only_han == r['han']:
            changed += _fill_one_fold_no(db, r, warns, '半页分配扣号，', ids) or 0
    print('\n'.join(warns))
    # 对超过6扣无号的非末页分配扣号
    ids = '485_10_3,299_10_5,328_1_4,332_4_5,334_4_2,338_7_2,347_10_2,347_2_4,358_4_2,365_9_3,380_7_3,383_10_2,384_6_2,386_9_2,428_1_2,485_10_3,384_6_4,383_10_4,383_10_5,384_6_1,384_6_5,386_9_1,428_1_4,428_1_5,428_1_6,428_1_7'


def fill_fold_lack_char(db, only_han=0):
    """对扣号文本缺少个别数字的进行修正"""
    changed, coll, max_nums = 0, db.sx_fold, {}
    cond = {'han': only_han} if only_han else {}

    # 撤销原先的自动补正
    coll.update_many({'fix_reason': {'$regex': '号，原扣号'}, **cond},
                     {'$set': {'text_status': 0}, '$unset': {'fix_reason': 1}})

    # 自动补正扣号，保留原始文本
    for r in coll.find({'text_status': 0, 'text': {'$regex': r'\d$'}, deleted: None,
                        **cond}, sort=[('bid', 1)]):
        han, vol_pdf, pid, bid, pi, idx = [r[f] for f in [
            'han', 'vol_pdf', 'pid', 'bid', 'pi', 'idx']]
        org_text = r.get('org_text') or r['text']
        a, _ = parse_name(org_text, idx)
        vol_fold, no_s = a[0][1:3]  # 扣名册号、扣号
        order = _get_order(db, pid)
        no_ok = vol_fold == str(vol_pdf) and make_page_no(han, vol_pdf, pi, idx, order)
        if not no_s or not no_ok or str(no_ok) == no_s:
            continue
        ok_s, like = str(no_ok), ''

        kv = _find_max_no_per_pi(max_nums, coll, cond, han, vol_pdf)
        due = _no_too_big(max_nums, kv, pi, no_ok)
        if due:  # 最大扣号小于计算扣号，很可能有重复页面
            coll.update_one({'_id': r['_id']}, {'$set': dict(text=org_text)})
            print(f"{bid},{vol_pdf},{no_s},{ok_s},{org_text},{org_text},"
                  f"因{due}，将 {r['text']} 恢复为原文本")
            continue

        if no_s in ok_s:
            like = '原扣号部分文本对'
        elif no_ok > 99 and len(no_s) > 1 and no_s[0] == ok_s[0] and no_s[-1] == ok_s[-1]:
            if no_s[1] == ' ':
                like = '原扣号中间是空格'
            elif len(no_s) == 2:
                like = '原扣号是少中间数字'
        elif 9 < no_ok < 100 and len(no_s) == 3 and no_s[1] == ' ' and \
                no_s[0] == ok_s[0] and no_s[-1] == ok_s[-1]:
            like = '原扣号中间多了空格'
        if like:
            text = re.sub(r'册.+$', f'册 {no_ok}', org_text)
            u = coll.update_one({'_id': r['_id']}, {'$set': dict(
                text=text, org_text=org_text, text_status=2, fix_reason=f'自动分配扣号，{like}')})
            if u.modified_count:
                changed += 1
                print(f'{bid},{vol_pdf},{no_s},{ok_s},{org_text},{text}')


def fill_fold_no(db):
    """对整册补充扣号文本"""
    changed, coll = 0, db.sx_fold
    for r in coll.find({'pdf_name': {'$in': ['忘字第07册', '恃字第05册']}, 'text': None,
                        'name_mean': {'$ne': None}}, sort=[('bid', 1)]):
        han, vol_pdf, pid, bid, pi, idx = [r[f] for f in [
            'han', 'vol_pdf', 'pid', 'bid', 'pi', 'idx']]
        order = _get_order(db, pid)
        no = make_page_no(han, vol_pdf, pi, idx, order)
        text = '大藏经' + r['pdf_name'].replace('第0', '第') + f' {no}'
        u = coll.update_one({'_id': r['_id']}, {'$set': dict(
            text=text, text_status=2, fix_reason=f'自动分配扣号')})
        if u.modified_count:
            changed += 1
            print(f'{bid},{vol_pdf},{no},{text}')


def _find_max_no_per_pi(max_nums, coll, q, han, vol_pdf):
    kv = f'{han}_{vol_pdf}'
    if kv not in max_nums:
        for r in coll.find({'text_status': 0, 'text': {'$regex': r'\d$'},
                            'han': han, 'vol_pdf': vol_pdf,
                            'org_text': None, deleted: None, **q},
                           dict(text=1, pi=1, bid=1), sort=[('pi', 1)]):
            a, _ = parse_name(r['text'], 1)
            vol2, no_s = a[0][1:3]
            if vol2 == str(vol_pdf) and re_digit.match(no_s):
                mk = max_nums[kv] = max_nums.get(kv) or dict(no=0, pi=-1, pi_no=[])
                if mk['no'] < int(no_s):
                    mk['no'] = int(no_s)
                    if mk['pi'] < r['pi']:
                        mk['pi'] = r['pi']
                        mk['pi_no'].append([r['pi'], mk['no'], r['text']])
                    else:
                        mk['pi_no'][-1][1] = mk['no']
                        mk['pi_no'][-1][2] = r['text']
    return kv


def _no_too_big(max_nums, kv, pi, no):
    d = max_nums.get(kv)
    if d:
        for pi_, no_, txt in max_nums[kv]['pi_no']:
            if pi > pi_:
                break
            if pi == pi_:
                return no > no_ + 10 and f'扣号大于当页的{no_}'
            if no >= no_:
                return f'扣号大于第{pi_ + 1}页的{no_}'


def _fill_many_fold_no(db, ids):
    warns = []
    for r in db.sx_fold.find(dict(bid={'$in': ids, deleted: None}), sort=[('bid', 1)]):
        _fill_one_fold_no(db, r, warns)
    print('\n'.join(warns))


def _fill_one_fold_no(db, r, warns, fix_prefix='', exclude_ids=None):
    han, vol_pdf, pid, bid, pi, idx = [r[f] for f in ['han', 'vol_pdf', 'pid', 'bid', 'pi', 'idx']]
    org_text = r.get('text')

    refs = [_get_fold_has_name(db, han, pid, i, exclude_ids)
            for i in range(10) if i != idx]
    refs = [f for f in refs if f and f.get('no')]  # (r, no, idx, no_ok)
    ref = refs and refs[0]
    bad = [f for f in refs if f['no'] != f['no_ok']]
    ref_text = refs and ref['r']['text'].strip()
    if not refs or bad:
        b = bad and bad[0]
        s = f"{len(bad)},{b['bid']} ({b['text']}) 扣号应为 {b['no_ok']}" if bad else ',没有参考扣'
        warns.append(f"{bid},{pid},{r.get('src', 'no-src')},{s}")
        return
    no = make_page_no(han, vol_pdf, pi, idx, ref['order'])
    text = re.sub(r'\d+$', str(no), ref_text)
    a, t = parse_name(text)
    assert t and int(a[0][2]) == no

    new_info = dict(text=text, org_text=org_text, text_status=2,
                    fix_reason=fix_prefix + f"参考{ref['r']['bid']}补全扣号")
    if not org_text:
        new_info.pop('org_text')
    if text == org_text:
        return

    u = db.sx_fold.update_one({'_id': r['_id'], deleted: None}, {'$set': new_info})
    if u.modified_count:
        print(f'{bid},{pid},{no},{text}')
    return u.modified_count


def _get_order(db, pid):
    ord_k = f'{pid}order'
    if not _cache.get(ord_k):
        p = db.sx_pdf_page.find_one({'pid': pid}, {'order': 1})
        _cache[ord_k] = p['order']
    return _cache[ord_k]


def _get_fold_has_name(db, han, pid, i, exclude_ids=None):
    """得到有扣号的扣记录"""
    r = db.sx_fold.find_one(dict(pid=pid, idx=i, deleted=None, text={'$nin': [None, '', '?']}))
    if r is not None and (not exclude_ids or r['bid'] not in exclude_ids):
        a, _ = parse_name(r['text'])
        if not re_digit.match(a[0][2] or ''):
            return dict(bid=r['bid'], text=r['text'], error='扣号错')
        no, idx = int(a[0][2]), i
        order = _get_order(db, pid)
        no_ok = make_page_no(han, vol_pdf, r['pi'], idx, order)
        return no and dict(r=r, no=no, idx=idx, no_ok=no_ok,
                           bid=r['bid'], text=r['text'], order=order)


def fix_ocr_text_149(db):
    """对扣号为149的重影扣名修正扣名"""
    ids = ['176_6_14_8', '177_1_14_8', '412_5_14_8', '419_5_14_8']
    changed = 0
    for r in db.sx_ocr.find({'bid': {'$in': ids}}):
        han, vol_pdf, pi, idx, text = [r[f] for f in ['han', 'vol_pdf', 'pi', 'idx', 'text']]
        next_r = db.sx_ocr.find_one(dict(han=han, vol_pdf=vol_pdf, pi=pi, idx=idx + 1))
        m = next_r and re.search(r'(^.+第\d+册\s*)(\d+)$', next_r['text'])
        if m and not re.search(r'册\s*\d+', text):
            new_text = m.group(1) + str(int(m.group(2)) - 1)
            u = db.sx_ocr.update_one({'_id': r['_id']}, {'$set': dict(
                text=new_text, org_text=text, fix_reason='扣号149重影')})
            changed += u.modified_count
    print(f'{changed} changed')


def fix_ocr_text_overlap_407(db):
    """对407函的重叠扣号对照和修正扣名"""
    _fix_ocr_text_with(db, '''
407_10_1_1	大藏经自字第自104	大藏经自字第自10册14
407_10_1_4	大藏经自字第自10助1	大藏经自字第自10册11
407_10_1_5	大藏经自字第自1016	大藏经自字第自10册16
407_10_1_6	大藏经自字第自10别17	大藏经自字第自10册17
407_10_1_8	大藏经自字第自1019	大藏经自字第自10册19
407_10_1_9	人藏经自字第自10P0	大藏经自字第自10册20
407_10_2_0	大藏经自字第自10P5	大藏经自字第自10册25
407_10_2_1	大藏经自字第自10P4	大藏经自字第自10册24
407_10_2_2	大藏经自字第自10P3	大藏经自字第自10册23
407_10_2_3	大藏经自字第自10P2	大藏经自字第自10册22
407_10_2_4	大藏经自字第自10P1	大藏经自字第自10册21
407_10_2_5	大藏经自字第自10P6	大藏经自字第自10册26
407_10_2_6	大藏经自字第自10P7	大藏经自字第自10册27
407_10_2_7	大藏经自字第自1028	大藏经自字第自10册28
407_10_2_8	大藏经自字第自10P9	大藏经自字第自10册29
407_10_2_9	人藏经自字第自10B0	大藏经自字第自10册30
407_10_3_0	大藏经自字第自10B5	大藏经自字第自10册35
407_10_3_1	大藏经自字第自10B4	大藏经自字第自10册34
407_10_3_2	大藏经自字第自10即3	大藏经自字第自10册33
407_10_3_3	大藏经自字第自10B2	大藏经自字第自10册32
407_10_3_4	大藏经自字第自10B1	大藏经自字第自10册31
407_10_3_5	大藏经自字第自10B6	大藏经自字第自10册36
407_10_3_6	大藏经自字第自10哪7	大藏经自字第自10册37
407_10_3_7	大藏经自字第自1038	大藏经自字第自10册38
407_10_3_8	大藏经自字第自10B9	大藏经自字第自10册39
407_10_3_9	人藏经自字第自1040	大藏经自字第自10册40
407_10_4_5	大藏经自字第自106	大藏经自字第自10册46
407_10_4_6	大藏经自字第自10m7	大藏经自字第自10册47
407_10_4_8	大藏经自字第自10以9	大藏经自字第自10册49
407_10_4_9	人藏经自字第自1050	大藏经自字第自10册50
407_10_5_0	大藏经自字第自1055	大藏经自字第自10册55
407_10_5_1	大藏经自字第自10班4	大藏经自字第自10册54''', '扣号与册字重叠')


def fix_ocr_text_overlap_49(db):
    _fix_ocr_text_with(db, '''92_1_5_0	/V从L」卫1W月	大藏经国字第1册55
92_2_10_5	◆、￥年六””一w·一一	大藏经国字第2册106
93_2_0_0	工"月和W小	大藏经有字第2册5
95_7_0_5	、w入上广罗」1”W	大藏经陶字第7册6
149_1_9_5	大藏空四子用I功口	大藏经四字第1册86
154_4_1_0	八臧空T庄子韦4订1)	大藏经惟字第4册15
154_8_0_0	、王任？制初	大藏经惟字第8册5
156_4_2_5	八咸红下布牛如么U	大藏经养字第4册26
159_5_0_5	、AA气Ad1中w	大藏经毁字第5册6
161_3_0_5	八贩工关中心川U	大藏经女字第3册6
161_8_0_5	入藏经又子弗6盯口	大藏经女字第8册6
162_8_0_0	/、风工寿丁有和拉》	大藏经慕字第8册5
163_4_0_5	天数经贝子吊4时0	大藏经贞字第4册6
163_6_0_0	人空从十吊0切U	大藏经贞字第6册5
311_10_0_0	/4业◆址u	大藏经从宇第10册5
402_3_1_0	、人如，"，求4州4”	大藏经持字第3册15
402_7_4_0	人藏经行子弟/册45	大藏经持字第7册45
403_8_3_0	人双至推子弟6叮D	大藏经雅字第8册35
407_5_5_0	入既堂目十师U明0D	大藏经自字第5册55
407_10_5_2	大藏经自字第自1053	大藏经自字第自10册53
407_10_5_3	大藏经自字第自1052	大藏经自字第自10册52
407_10_5_4	大藏经自字第自10班1	大藏经自字第自10册51
407_10_6_0	大藏经自字第自105	大藏经自字第自10册65
407_10_6_1	大藏经自字第自10哪4	大藏经自字第自10册64
407_10_6_2	大藏经自字第自103	大藏经自字第自10册63
407_10_6_3	大藏经自字第自10嘴2	大藏经自字第自10册62
407_10_6_4	大藏经自字第自10选1	大藏经自字第自10册61
407_10_6_5	大藏经自字第自1066	大藏经自字第自10册66
407_10_6_6	大藏经自字第自10临7	大藏经自字第自10册67
407_10_6_8	大藏经自字第自1059	大藏经自字第自10册69
407_10_6_9	人藏经自字第自1070	大藏经自字第自10册70
407_10_7_4	大藏经自字第自10册1	大藏经自字第自10册71
407_10_7_5	大藏经自字第自106	大藏经自字第自10册76
407_10_7_6	大藏经自字第自1077	大藏经自字第自10册77
407_10_7_8	大藏经自字第自1079	大藏经自字第自10册79
407_10_7_9	人藏经自字第自10B0	大藏经自字第自10册80
411_4_1_5	入默经半子弟4叮口	大藏经华字第4册16
412_5_14_5	人题级经复子弟5时146	大藏经夏字第5册146
417_11_0_0	年的4#de丰无址#	大藏经背字第11册5
418_9_10_0	票年年中卡华参	大藏经邙字第9册105
419_10_11_0	/从工河7)11	大藏经面字第10册115
435_7_0_0	大藏经离子弟/册5	大藏经禽字第7册5
442_3_3_0	大概经香子弟33约	大藏经舍字第3册35
459_6_0_0	八工】和显)	大藏经纳字第6册5
462_3_0_0	人经5子带3切口	大藏经转字第3册5
462_8_0_4	大戴经转子弟8时1	大藏经转字第8册1
464_6_0_0	入概立生寸布U围明)	大藏经星字第6册5
471_5_0_5	八照工界为U小U	大藏经承字第5册6
487_7_0_0	大概经壁子弟/册5	大藏经壁字第7册5''', '扣名模糊不全')


def _fix_ocr_text_with(db, tsv_text, fix_reason):
    tsv = [s.strip().split('\t') for s in tsv_text.strip().split('\n')]
    d = {s[0]: s for s in tsv}
    changed, ok = 0, 0
    for r in db.sx_ocr.find({'bid': {'$in': list(d.keys())}}):
        bid, text, org_text = [r[f] for f in ['bid', 'text', 'org_text']]
        if d[bid][1] == org_text:
            ok += 1
            db.sx_ocr.update_one({'_id': r['_id']}, {'$set': dict(fix_reason=fix_reason)})
        elif d[bid][1] == text:
            u = db.sx_ocr.update_one({'_id': r['_id']}, {'$set': dict(
                text=d[bid][2], org_text=text, fix_reason=fix_reason)})
            changed += u.modified_count
    print(f'{changed} changed, {ok} exists')


def _fix_pdf_text_as_first_name(db, ids, fix_reason=''):
    changed = []
    for r in db.sx_pdf_page.find({'pid': {'$in': ids}}):
        pid, text, org_text = [r[f] for f in ['pid', 'text', 'org_text']]
        texts, old_text = text.split('\n'), text
        for i, t in enumerate(texts):
            texts[i] = re.sub(r'(册\s*\d+)(\s*大藏经.+$)', lambda m: m.group(1), t)
        text = '\n'.join(texts)
        if text != old_text and fix_reason:
            org_text = org_text or old_text
            u = db.sx_pdf_page.update_one({'_id': r['_id']}, {'$set': dict(
                fix_reason=fix_reason, text=text, org_text=org_text)})
            if u.modified_count:
                changed.append(pid)
    print(f"{len(changed)} changed: {','.join(changed)}")


def _update_words(db, ids, coll='sx_pdf_page'):
    re_w = re.compile(r'([\u4e00-\u9fa5],\d+,)(\d+[ \d]*)(,\d,[^,册]+册 )(\d+) ?(\n|$)')
    for r in db[coll].find({'pid': {'$in': ids}}):
        words, changed = r['words'].split('\n'), 0
        for i, w in enumerate(words):
            m = re_w.search(w)
            if m:
                a, b, c, d, e = [m.group(i + 1) for i in range(5)]
                s = ''.join([a, d, c, d, e])
                if s != w:
                    words[i] = s
                    changed += 1
        if changed:
            db[coll].update_one({'_id': r['_id']}, {'$set': {'words': '\n'.join(words)}})
            print(r['pid'])


def check_fold_names(db, only_han=0):
    """标记扣名册号、扣号、是否缺册号、缺扣号、多扣"""
    def add_check(**d):
        if d:
            if d['fold_no'] and not d.get('fold_id'):
                vol_ok = d.get('vol_ok') or d['vol_fold']
                d['fold_id'] = f"{d['han']}_{vol_ok}_{d['fold_no']}"
            buf.append((bid, d))
        if buf and (not d or len(buf) > 20):
            db.sx_fold_check.bulk_write([UpdateOne({'bid': b}, {'$set': d}, upsert=True)
                                         for b, d in buf])
            buf.clear()

    buf = []
    cond = dict(han=only_han, text={'$ne': None}, deleted=None)
    if not only_han:
        cond.pop('han')

    for r in db.sx_fold.find(cond, sort=[('bid', 1)]):
        han, vol_pdf, pid, bid, pi, idx, end = [r[f] for f in [
            'han', 'vol_pdf', 'pid', 'bid', 'pi', 'idx', 'end']]
        err_vol, err_no, fail_parse, ok = None, None, None, False
        vol_fold, fold_no, should_no = 0, 0, 0

        text = clean_text(r['text'])
        try:
            fail_parse = _check_text_can_not_parse(fail_parse, text)
            ps = parse_name(text, idx)
            kc, vol_fold_s, fold_no_s = list(ps[0][0])[:3]

            err_no, err_vol, fold_no, vol_fold = _check_vol_fold_no(
                err_no, err_vol, fold_no, vol_fold, fold_no_s, vol_fold_s)
            vol_fold = r.get('vol_fold') or vol_fold
            fold_no = r.get('fold_no') or fold_no

            ok = not (err_vol or err_no or fail_parse)
            if ok:
                should_no = _check_vol_after_ok(db, han, vol_fold, fold_no, should_no,
                                                vol_pdf, pid, pi, idx)
        except (IndexError, ValueError) as e:
            if not fail_parse and e:
                fail_parse = '其它错误'
        add_check(han=han, vol_pdf=vol_pdf, pid=pid, pi=pi, idx=idx, end=end, ok=ok,
                  should_no=should_no, vol_ok=r.get('vol_ok'),
                  fail_parse=fail_parse, err_vol=err_vol, err_fold_no=err_no,
                  vol_fold=vol_fold, fold_no=fold_no, pdf_name=r['pdf_name'],
                  empty=not r.get('fold_mean'), order=_get_order(db, pid),
                  text=None if ok and not should_no else text)
    add_check()


def _check_vol_after_ok(db, han, vol_fold, fold_no, should_no, vol_pdf, pid, pi, idx):
    if vol_fold != vol_pdf:
        should_no = 'vol_diff'
    else:
        right_no = make_page_no(han, vol_pdf, pi, idx, _get_order(db, pid))
        if right_no != fold_no:
            should_no = right_no
    return should_no


def _check_text_can_not_parse(fail_parse, text):
    if re.match(r'^\d+$', text):
        fail_parse = '扣名全是数字'
    elif '册' not in text:
        fail_parse = '没有册字'
    elif len(re.findall('册', text)) != 1:
        fail_parse = '多个册字'
    return fail_parse


def _check_vol_fold_no(err_no, err_vol, fold_no, vol_fold, fold_no_s, vol_fold_s):
    if not re.match(r'^\d+$', f'{vol_fold_s}'):
        err_vol = vol_fold_s or '?'
    else:
        vol_fold = int(vol_fold_s)
        if vol_fold < 1 or vol_fold > 548:
            err_vol = vol_fold or 'no'

    if not re.match(r'^\d+$', f'{fold_no_s}'):
        err_no = fold_no_s or '?'
    else:
        fold_no = int(fold_no_s)
        if fold_no < 1 or fold_no > 300:
            err_no = fold_no or 'no'
    return err_no, err_vol, fold_no, vol_fold


def check_fold_and_sum(db, only_han=0):
    def add_count(title, cond, level=1):
        n, rs, ps = coll.count_documents(cond), '', ''
        if n == 0:
            return
        if n < 100:
            r = coll.find_one(cond)
            text = r.get('text')
            no, vol_pdf = r.get('fold_no'), r.get('vol_fold')
            m1 = re.search(r'册\s(\d+)', text or '')
            same_no = '，号对' if m1 and int(m1.group(1)) == (r.get('should_no') or no) else ''
            r = f"\n\t{r['bid']}{f'(第{vol_pdf}册{no}扣{same_no})' if no else ''}" \
                f"{' “%s”' % text[:20] if text else ''}"
            rs += r

        if n < 10000:
            ps = list(coll.aggregate([{'$match': cond}, {'$group': {
                '_id': '$pid', 'n': {'$sum': 1}}}, {'$sort': {'n': -1, '_id': 1}}]))
            rs = f'、{len(ps)} 页' + rs
            ps = f"，例如 {'、'.join('%s(%d扣)' % (p['_id'], p['n']) for p in ps[:2])}"
        result.append('-' * level + f' {title}：{n} 条{rs}{ps}')

    # _fix_pdf_text_as_first_name(db, '406_5_7,409_1_9,409_3_8,517_2_2,97_9_9,405_6_6,'
    #                                 '518_6_4,380_5_6,412_1_12,441_1_8,422_1_12'.split(','))
    check_fold_names(db, only_han)
    coll, result = db.sx_fold_check, []

    add_count('有册号和扣号，扣号与连续规则一致', {'ok': True, 'should_no': 0})
    add_count('有册号和扣号，(扣名)册号与文件册号不同', {'should_no': 'vol_diff'})
    add_count('有册号和扣号，扣号与规则不一致', {'should_no': {'$gt': 0}})
    add_count('没有册号', {'err_vol': {'$ne': None}})
    add_count('没有扣号', {'err_fold_no': 'no'})

    add_count('无法解析册号（如下查询{fail_parse:type}）', {'fail_parse': {'$ne': None}})
    for m in ['扣名全是数字', '没有册字', '多个册字', '其它错误']:
        add_count(m, {'fail_parse': m}, 2)

    print('\n'.join(result))


def main(db_name='sx_pdf', func='', only_han=0):
    with_db(db_name, lambda db: eval(func or 'check_fold_and_sum')(db, int(only_han)))


if __name__ == '__main__':
    import fire

    fire.Fire(main)
